<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="utf-8">
    <title>Knowit Developer Summit 2013</title>
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="Knowit Developer Summit 2013">
    <meta name="author" content="Knowit">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le styles -->
    <link href="css/bootstrap.css" rel="stylesheet">
    <link href="css/bootstrap-responsive.min.css" rel="stylesheet">
    <link href="css/self.css" rel="stylesheet">
    <link rel="stylesheet" type="text/css"
          href="http://cloud.github.com/downloads/lafeber/world-flags-sprite/flags32.css"/>
</head>

<body>

<div class="container">
<header class="subhead">
    <div class="row">
        <div class="span8">
            <h1><a href="index.html">Knowit Developer Summit</a></h1>

            <p class="lead">Oslo, 12 - 13 April 2013</p>
        </div>

        <div class="span2">
            <ul class="f32">
                <a href="index.html">
                    <li class="flag no"></li>
                </a>
                <a href="index_en.html">
                    <li class="flag gb"></li>
                </a>
            </ul>
        </div>
    </div>

    <div class="row">
      <div class="span8">
        <h2><a href="#lightning_talks">Lightning talks</a> &ndash; <a href="#presentations">Presentations</a> &ndash; <a href="#workshops">Workshops</a></h2>
      </div>
    </div>
</header>

<section id="home">
<div class="row" id="lightning_talks">
<div class="span9">
<div class="talk" id="utfordringer_moden_soa">
    <div class="title">Utfordringer med en moden SOA</div>
    <div class='abstract'>En moden tjenesteorientert arkitektur har oppn&aring;dd f&oslash;lgende:
<ul>
<li>Flere tjenester som brukes og gjenbrukes p&aring; tvers av organisasjonen</li>
<li>Klart definert eierskap/abonnent p&aring; grunndata</li>
<li>Tilgjengelige tjenester er en viktig del av prosjektplanlegging</li>
</ul>
Hvilke nye utfordringer skaper en slik situasjon?
    </div>
    <div class='speaker'>Tor Magne Lindeberg</div>
    <div class='speaker_bio'>Tor Magne Lindeberg har 8 &aring;rs erfaring som utvikler og arkitekt, og har siden 2007 prim&aelig;rt jobbet med integrasjon i en stor virksomhets tjenesteorienterte arkitektur. Han har ved to anledninger holdt foredrag p&aring; JavaZone i Oslo.
    </div>
</div>

<div class="talk" id="menneskelig_multitasking">
    <div class="title">En &oslash;velse i menneskelig multitasking</div>
    <div class='abstract'>Blir du avbrutt av dine kolleger til stadighet?<br>
      Kommer spørsmålene akkurat i det du er inne i flytsonen?<br><br>
      Hvis du er en av dem som spør før du tenker, så er denne øvelsen for deg.<br><br>
      I denne lyntalen (som er av ikke-teknisk art) gjennomfører vi en øvelse som viser effekten av menneskelig multitasking.
    </div>
    <div class='speaker'>Kenneth Stigen</div>
    <div class='speaker_bio'>Kenneth jobber i Know IT Objectnet og har jobbet i konsulentbransjen siden 2004.
      Han har sin kjernekompetanse innenfor objektorientert utvikling av Java/JEE-l&oslash;sninger.
      Kenneth har deltatt p&aring; mange store prosjekter, og flesteparten av dem innenfor telekom.
      Kenneth jobber for tiden med &aring; f&aring; folk flest til &aring; ta tog.
    </div>
</div>

<div class="talk" id="jersey_ukomplisert_rest">
    <div class='title'>Jersey - Ukomplisert REST fra Sun</div>
    <div class='abstract'>Legg til en dependency og et par annotasjoner p&aring; metodene du vil eksponere. En
        annotasjon til og du kan benytte standard HTTP-autentisering. <br/><br/>Det er Sun som st&aring;r bak, men vi
        erfarte at det er uproblematisk &aring; benytte ogs&aring; p&aring; mindre prosjekter som kj&oslash;rer p&aring; Jetty. <br/><br/>Jersey er
        et ukomplisert rammeverk fra et trygt navn gj&oslash;r det enkelt &aring; f&aring; REST inn i ditt neste prosjekt.
    </div>
    <div class='speaker'>H&aring;vard S&oslash;rensen</div>
    <div class='speaker_bio'>H&aring;vard S&oslash;rensen jobber p&aring; Java-prosjekter hos Knowit i Oslo</div>
</div>

<div class="talk" id="phonegap">
    <div class="title">Phonegap – apputvikling for webutviklere</div>
    <div class='abstract'>Hva er Phonegap? Hva kan det bruke til? Hvordan virker det? Hvilke begrensninger må man forholde seg til?
    </div>
    <div class='speaker'>Anders Brenna</div>
    <div class='speaker_bio'>Anders Brenna kommer fra internett. Han er tidligere nettsjef i Teknisk Ukeblad og redaksjonssjef i digi.no.
        Nå jobber han som forretningsutvikler og teknologievangelist i Knowit.
    </div>
</div>

<div class="talk" id="perspektiver_pa_tid">
    <div class="title">Perspektiver p&aring; tid</div>
    <div class='abstract'>Zimbardo har skrevet en bok om hvordan mennsker lever livet forskjellig gitt hvordan de
        tenker om tid (http://www.thetimeparadox.com/zimbardo-time-perspective-inventory/) &oslash;nsker &aring; se innholdet i
        denne i sammenheng med estimering p&aring; softwareoppgaver.
    </div>
    <div class='speaker'>Tanja Gruschke</div>
    <div class='speaker_bio'>Tanja er ansatt i Knowit Objectnet som Java-utvikler. Hun har tidligere jobbet som
        stipendiat / forskningsassistent ved Simula–senteret. Tanja er kreativ, l&oslash;sningsorientert og bidrar alltid
        positivt i prosjekter. Tanja er interessert i b&aring;de &aring; f&aring; overordnet og detaljert oversikt over prosjektet hun
        er p&aring; for &aring; kunne bidra til at arbeidsprosessen hele tiden blir optimalisert til oppgaven som skal l&oslash;ses.
    </div>
</div>

<div class="talk" id="kommende_webstandarder">
    <div class="title">TBA</div>
    <div class='abstract'>En liten teaser på hvilke web standarder er under utvikling, og hva kan vi vente av dem.
    </div>
    <div class='speaker'>Cathrine Riise Dannevig</div>
    <div class='speaker_bio'>
    </div>
</div>

<div class="talk" id="rails_deployment_java">
    <div class="title">Ruby on Rails deployment til Java kj&oslash;remilj&oslash;</div>
    <div class='abstract'>I Oslo Kommune har vi i vinter laget 2 nye Ruby on Rails fagsystemer. Ett av kravene
        for disse applikasjonene var at de m&aring;tte kunne deployes og kj&oslash;res p&aring; Java milj&oslash;et som allerede fantes p&aring;
        Oslo Kommunes platform (ITAS). I lyntalen vil jeg g&aring; igjennom hvordan vi hvilke teknologier vi brukte og
        hvordan vi integrerte Ruby on Rails for &aring; kunne bygge og deploye applikasjonene v&aring;re til ITAS, som om de var
        en helt vanlig Java applikasjon.
    </div>
    <div class='speaker'>Jon Vassb&oslash;</div>
    <div class='speaker_bio'>Jon er en lynskarp, kreativ, reflektert og im&oslash;tekommende utvikler, som gjennom sin
        genuine interesse for IT har opparbeidet seg utf&oslash;rlig kompetanse p&aring; interaktive webl&oslash;sninger. Faglig er han
        en klippe, sv&aelig;rt engasjert og hans kunnskap favner b&aring;de dypt og bredt. Spesielt gjelder dette webbaserte
        l&oslash;sninger og ulike teknologiers muligheter og spissfindigheter.
    </div>
</div>

<div class="talk" id="erfaringer_med_activemq">
    <div class="title">Erfaringer med ActiveMQ</div>
    <div class='abstract'>En presentasjon om bruk og erfaringer av ActiveMQ i Oslo Kommune, hvor det brukes som
        JMSbroker p&aring; fire forskjellige maskiner med parvis nettverksbro mellom. Fokus rettes mot teknologiens
        modenhet, hvordan den brukes i kommunen og hvilke problemer som har dukket opp underveis.
    </div>
    <div class='speaker'>Robin K&aring;veland Hansen</div>
    <div class='speaker_bio'>Robin hadde sommerjobb i Knowit i 2011, og begynte i fast stilling etter endt
        utdannelse i 2012. Han har kjernekompetanse innen objektorientert systemutvikling og har prosjekterfaring
        med spr&aring;k og teknologier som C, Haskell, Java, Lisp, Python, Ruby og Shell scripting. Til daglig jobber han
        i Oslo Kommune hvor han koder hovedsaklig Java og Ruby i tillegg til &aring; debugge ActiveMQ-brokere.
    </div>
</div>

<div class="talk" id="meatspace-free_dev">
    <div class="title">Meatspace-free development</div>
    <div class='abstract'>Open-source projects in terms of people scale to the hundreds and their quality remain
        high enough to attain and sustain enormous user-bases, in other words they survive well. This talk will look
        at how open source projects approach showing off work, tracking changes, project-management and particularly
        communication. We&#39;ll also look at distilling and adapting meatspace-free development in modern teams and
        what the pros and cons to doing so are.
    </div>
    <div class='speaker'>David Ed Mellum</div>
    <div class='speaker_bio'>David is a systems developer for Knowit Reaktor Kyber with a love for simple, concise
        and elegant problem solving. He&#39;s worked doing everything from devops to building real-time web-apps,
        HTML5 mobile apps and CMS-based sites. He&#39;s a huge open source advocate contributing to several projects
        and maintaining several of his own projects.
    </div>
</div>

<div class="talk" id="git_deploy">
    <div class="title">Git Deploy!</div>
    <div class='abstract'>We are utilising the strengths of Git in a novel way to replace existing methods of
        client and server software distribution and deployment in a large organisation with locations all across
        Norway. <br/><br/>Come see how Git helps us solve issues like missing software updates, early distribution
        of new versions, clients running test versions in production, and more!
    </div>
    <div class='speaker'>Fredrik Vraalsen</div>
    <div class='speaker_bio'>Fredrik&#39;s main interest as a developer is languages, techniques, methods and tools
        that can improve efficiency, quality and not least the joy of programming. The last couple of years his
        focus has been on alternative JVM languages like Scala and Clojure, in particular the functional programming
        aspects. He likes to find ways to apply these principles in his daily work as Java developer. Fredrik has
        over 10 years of experience as a software developer working with Java EE, Swing client applications and
        Java/C++ on mobile devices.
    </div>
</div>

<div class="talk" id="rubymotion">
    <div class="title">RubyMotion - Developer happiness for iOS</div>
    <div class='abstract'>Many of us want to be able to write apps for the iOS platform, but the thought of
        having to learn the full Xcode stack and tons of Apple SDKs seems quite daunting. There are alternatives
        like PhoneGap etc., but they just don&#39;t provide the same experience as something fully native except for
        the simplest of apps (no matter what the HTML5-pundits say). RubyMotion is a relatively new product which
        offers a really compelling alternative to Xcode, while still running as fully native compiled Objective-C
        code. Being a dialect of Ruby, it brings the same developer happiness it&#39;s famous for on the desktop to
        the iOS platform. In this lightning talk I&#39;ll show you how easy it is to get started.
    </div>
    <div class='speaker'>Bj&oslash;rn Arild M&aelig;land</div>
    <div class='speaker_bio'>Bj&oslash;rn works at Knowit Reaktor Kyber, where he currently works with Ruby and various web
        technologies.
    </div>
</div>

<div class="talk" id="kommende_webstandarder">
    <div class="title">Kommende webstandarder</div>
    <div class='abstract'>
    </div>
    <div class='speaker'>Marius Nielsen</div>
    <div class='speaker_bio'>
    </div>
</div>
</div>
</div>

<div class="row" id="presentations">
<div class="span9">
<div class="talk" id="ddd_architecture">
    <div class='title'>DDD Architecture in Practice</div>
    <div class='abstract'>A presentation about a running project building a national study administration system
        for higher education comprising all universities in Sweden.<br/><br/>We are building a completely new system
        and basic principles of the architecture has been domain-driven design, a service-oriented architecture with
        autonomous services, message-based and event-driven, a decentralized data architecture, RESTful-based
        communication using the web as platform.<br/>Behaviour-driven development, BDD, supported by functional
        tests with Cucumber to verify functionality, and Test Driven Development.
    </div>
    <div class='speaker'>Jan Stenberg</div>
    <div class='speaker_bio'>A system developer and architect that has been working for Knowit a very long time.
        Passionate about using good methods, practices and techniques to build high quality systems.<br/>Working on
        both C#/.NET and Java/JVM platforms.
    </div>
</div>

<div class="talk" id="ulstein_bridge_vision">
    <div class='title'>Ulstein Bridge Vision</div>
    <div class='abstract'>Ulstein Bridge Vision er et forskningsprosjekt utf&oslash;rt p&aring; Arkitektur og designh&oslash;gskolen
        i Oslo i samarbeid med Ulstein. Prosjektet har g&aring;tt ut p&aring; &aring; ta i bruk ny teknologi for &aring; endre m&aring;ten man
        utformer broen p&aring; supply-b&aring;ter. Denne presentasjonen vil g&aring; igjennom prosjektet.
    </div>
    <div class='speaker'>Raymond Koteng</div>
    <div class='speaker_bio'>Mr. Koteng is a full-fledged developer with particular interest for IxD and UI
        targeting Web and mobile platforms. He has been with Knowit since 2007 and has several years of experience
        developing complex Java based web-applications with extensive use of Ajax and Web 2.0. He also develops
        Android-applications and can boast HTML(5) and CSS(3) competence.
    </div>
</div>

<div class="talk" id="testautomatisering">
    <div class='title'>Hvordan lykkes med testautomatisering</div>
    <div class='abstract'>Det er et økende behov for testautomatisering av IT-systemer. Det stilles krav om høyere endringstakt, redusert time to market, samtidig som brukerne har større krav til kvalitet, stabilitet og brukeropplevelse. Kompleksitet i integrasjonspunkter og antall digitale flater bidrar ytterligere til at kvalitetssikring blir en utfordring. Ved å automatisere deler av testarbeidet kan man imøtekomme disse trendene, og samtidig opprettholde kostnadseffektive prosesser for utvikling og forvaltning.
<br><br>
Testautomatisering er imidlertid en krevende øvelse hvor flere har feilet, og det er viktig å gjøre det riktig fra begynnelsen. Knowit Quality Management har bred erfaring fra et betydelig antall automatiseringsprosjekter, og vi vil i dette foredraget dele noen av disse erfaringene med deg.
<br><br>
Agenda:
<ul>
<li>Hva kan, bør, og bør ikke automatiseres</li>
<li>Utfordringer med testautomatisering på web og mobil</li>
<li>Hvordan velge riktig verktøy</li>
<li>Hvordan etablere et rammeverk for testautomatisering</li>
<li>Demo</li>
</ul>
    </div>
    <div class='speaker'>Rajkumar Rajangam</div>
    <div class='speaker_bio'>
    </div>
</div>

<div class="talk" id="klyv_ned_i_skallet">
    <div class='title'>Klyv ned i skallet ditt og bli der</div>
    <div class='abstract'>Skallskripting og interaksjon med skallet, kan v&aelig;re en essentsiell del av en utviklers
        verkt&oslash;ykasse. Jeg vil vise hvordan, og hvorfor, jeg bruker disse verkt&oslash;yene for &aring; bli mer produktiv, f&aring;
        bedre kontroll og best av alt, bli mer motivert for &aring; gj&oslash;re jobben min.
    </div>
    <div class='speaker'>Anders Brujordet</div>
    <div class='speaker_bio'>Anders has a passion for *NIX and automation. He works as a java developer in Oslo,
        Norway and is currently occupied with the development and management of the Oslo Municipality Organisational
        Systems.
    </div>
</div>

<div class="talk" id="integrasjon_som_skalerer">
    <div class='title'>Integrasjon som skalerer uten &aring; bli flaskehals</div>
    <div class='abstract'>En av Norges st&oslash;rste bedrifter, Oslo kommune, har utviklet en omfattende integrasjonsplattform
        basert p&aring; &aring;pne biblioteker og standarder, best practice for deployment, lastbalansering,
        konfigurering, overv&aring;kning og organisering av tjenester. Denne vedlikeholdes til enhver tid
        av et 20-talls utviklere p&aring; oppdrag fra 40-50 forskjellige interessenter med sine egne krav,
        planer og leveransel&oslash;p. Alt sammen muliggj&oslash;res ved delegering av ansvar til de enkelte utviklerne,
        som ogs&aring; drifter plattformen.<br><br>
        Erfaringsforedraget beskriver utviklerens hverdag og hvordan prosjektet i praksis h&aring;ndteres med
        bruk av metoder som feature branching, pull requests, DevOps, kontinuerlige leveranser innenfor ITIL,
        og teknologi som github, puppet, nagios og release/deployment med rubyscripts.
    </div>
    <div class='speaker'>Jan Henrik Gundelsby, Rune Storl&oslash;pa</div>
    <div class='speaker_bio'>Jan Henrik er Cand. scient. og har 15 &aring;rs erfaring med serverside Java-teknologi, b&aring;de
        J2EE og lettvektsrammeverk. Han jobber i dag for Knowit som teknisk prosjektleder, arkitekt og utvikler for
        et st&oslash;rre offentlig IT-prosjekt. Jan Henrik er fagleder for DevOps i Knowit og en ivrig lettvekts-fantast
        som fors&oslash;ker &aring; jobbe mot smidige arkitekturer og l&oslash;sninger.<br/><br/>Rune har i sine dr&oslash;ye 10 &aring;r i bransjen
        jobbet mye med arkitektur og utvikling p&aring; Java-plattform i st&oslash;rre enterprise systemer. B&aring;de p&aring; klient- og
        serverside, og b&aring;de med tunge J2EE-servere og lettvektsrammeverk. Idag jobber han for Knowit som
        teknisk-/l&oslash;sningsarkitekt og utvikler p&aring; et st&oslash;rre offentlig IT-prosjekt.
    </div>
</div>

<div class="talk" id="objectnet_way">
    <div class='title'>The Objectnet Way</div>
    <div class='abstract'>In this session, we will present ways of doing things that we believe are somewhat
        unique in Knowit Objectnet - and that are small but crucial contributions to our company&#39;s success. The
        session will follow a &quot;Birds of a Feather&quot;-format: We will open for discussion during the talk. We&#39;d
        love to hear your opinions on how we do things, as well as how things are done in other Knowit
        companies.<br/><br/>The session will be split into three major parts. In each part, we will describe some
        aspect of The Objectnet Way and discuss how it works.<br/><br/>In part 1, &quot;Heterogenous Developer
        Environments&quot;, we will describe how most Knowit Objectnet developers are allowed to choose their own
        tools - from their OS to their IDE, from supporting tools to even supporting more than one build tool in
        some rare projects.<br/><br/>In part 2, &quot;Experimental Superprojects&quot;, we will present how we&#39;ve
        managed to land projects using cool new technologies such as Scala and Ruby, and how these have gone on to
        become some of Knowit Objectnet&#39;s greatest success stories.<br/><br/>Part 3, dubbed &quot;If There&#39;s
        Doubt, There&#39;s No Doubt&quot; will look at the way Knowit Objectnet screens potential new recruits.
        Here, actual developers participate in the process of hiring new hands - without leadership present - and
        have the power to say no if there is any doubt that the candidate is suitable.
    </div>
    <div class='speaker'>Sigmund Marius Nilssen</div>
    <div class='speaker_bio'>Sigmund M. Nilssen er seniorkonsulent i Knowit Objectnet. Han startet karrieren som
        programmerer p&aring; simuleringsprosjekter i forskningssektoren. Siden 2007 har han jobbet som konsulent, og har
        hatt roller fra programmerer til arkitekt til prosjektleder p&aring; sm&aring; og mellomstore Java- og Scala-prosjekter.
        I Knowit Objectnet jobber han ogs&aring; noe med rekruttering. Ved siden av konsulenthverdagen jobber Sigmund som
        danseinstrukt&oslash;r p&aring; kveldstid.
    </div>
    <div class='speaker'>Tobias Torrissen</div>
    <div class='speaker_bio'>Tobias Torrissen er fagsjef i Knowit Objectnet. Han har over 11
        &aring;rs erfaring fra konsulentbransjen hvor han stort sett har jobbet med utvikling av store mellomvarel&oslash;sninger
        implementert i Java. Tobias er tidligere styremedlem i javaBin og satt i JavaZones programkomite fra
        2004-2009. Tre av disse &aring;rene fungerte han som leder.
    </div>
</div>

<div class="talk" id="trygdekontoret">
    <div class='title'>Trygdekontoret: D&aring;rlig kodekvalitet skyldes alt annet enn d&aring;rlige utviklere</div>
    <div class='abstract'>Å ha en kodebase med god kodekvalitet er viktig for utvikleres mentale helse. Å ha utviklere med god mentalhelse er viktig for prosjektene. Derfor er god kodekvalitet viktig for prosjektet.
<br><br>
I denne bof-en blir påstander om kodekvalitet og hva som påvirker denne, fremstatt av trygdebeistene Alf Kristian og Tobias. Deretter blir de diskutert i plenum før vedtak fattes.
<br><br>
Bli med på denne BOF-en og hør hva andre mener om kodekvalitet og hvordan vi skal oppnå dette i prosjektene  våre.
<br><br>
Og husk: <a href="https://dl.dropbox.com/u/1833700/prosjektledere.ogg">https://dl.dropbox.com/u/1833700/prosjektledere.ogg</a>
    </div>
    <div class='speaker'>Alf Kristian St&oslash;yle</div>
    <div class='speaker_bio'>Alf Kristian er en engasjert og aktiv utvikler som hele tiden fors&oslash;ker &aring; fornye seg.
        Han har nesten 9 &aring;rs erfaring med utvikling, men fors&oslash;ker hele tiden &aring; utfordre det han allerede
        kan.
    </div>
    <div class='speaker'>Tobias Torrissen</div>
    <div class='speaker_bio'>Tobias Torrissen er fagsjef i Knowit Objectnet. Han har over 11
        &aring;rs erfaring fra konsulentbransjen hvor han stort sett har jobbet med utvikling av store mellomvarel&oslash;sninger
        implementert i Java. Tobias er tidligere styremedlem i javaBin og satt i JavaZones programkomite fra
        2004-2009. Tre av disse &aring;rene fungerte han som leder.
    </div>
</div>

<div class="talk" id="responsive_design_answer">
    <div class='title'>Responsive design is the answer - but what was the question?</div>
    <div class='abstract'>In the SF book &quot;The Hitchhikers Guide to the Galaxy&quot;, one of the main
        characters views the universe through a pair of Peril Sensitive sunglasses - sunglasses that blocks out
        anything potentially dangerous in your field of vision so you can carry on doing what you&#39;re doing
        without worrying too much. <br/>The sunglasses operate by projecting directed &quot;SEP-fields&quot; (where
        SEP is short for &quot;Somebody Else&#39;s Problem&quot;) at the wearer in order to trick the wearer&#39;s
        brain into ignoring any potential hazards and thereby simply stopping the wearer from seeing them.<br/>
        <br/>This session is about exploring the current state of Responsive web design (RWD) from selected angles
        to find out if we somehow unintentionally haven&#39;t ended up being influenced by something like a
        collective SEP-field where essential aspects of web standards, accessibility, Ux etc. might not be optimally
        handled (Because they’re somebody else’s problem) in our rush to cater to our customers cravings for
        responsive design solutions…<br/>… and if that should be the case, to inspire to further discussions on how
        we can make our best practices for delivering good user experiences on the web even better.<br/> <br/> ·
        Responsive - to what?<br/> · RWD vs. Separate sites/channels – what’s the rumpus?<br/> · About Ux and
        providing choice when needed<br/> · Applying TWAP (as in &quot;The Web Ain&#39;t print&quot;) principles to
        RWD<br/> · Configurability options within the current design - where did those go?<br/> · What would User
        adaptible RWD look like?<br/> <br/> · If you structure content – your design will respond<br/> ·
        WYSIWYG is dead - long live WYSIWYG<br/> · Structured content – the new crown Prince?<br/> · The Markdown
        effect<br/> · A11y / SEO / SEC aspects of structured content<br/> <br/> · The open web stack to the
        rescue!<br/> · HTML5 - an umbrella term for much more than just markup<br/> · Scripting dependent web design
        - dream or reality ?<br/> · Can we start rethinking established design patterns based on the open web stack
        concepts (like scripting capabilities) now?<br/> · Should we?<br/> · Arent&#39; we already doing it?<br/> ·
        … and where can we go from here?
    </div>
    <div class='speaker'>&Aring;ke Järvklo</div>
    <div class='speaker_bio'>&Aring;ke Järvklo is a Web solutions specialist / EPiServer Certified Developer / Senior Web
        Front End guy at Web &amp; Collaboration, Knowit Norrland.<br/>He&#39;s also keen on Good web practices,
        Standards, Accessibility, Mobility &amp; Open Source
    </div>
</div>

<div class="talk" id="maintainable_css">
    <div class='title'>Maintainable CSS - The Next Frontier of Front-End Engineering</div>
    <div class='abstract'>For over a decade, web development has been unthinkable without CSS.  Yet the way how CSS is authored is far away from the professionalism we use in the rest of our code. Most developers try to avoid touching the project's stylesheets, as these contain unmaintainable spaghetti code.<br><br>
This can be improved by transferring common practices of software engineering to CSS authoring:
<ul>
<li>With some additions, transcompilers like Sass allow to use the KISS and DRY concepts.</li>
<li>Applying object-orientation to CSS will make it SOLID.</li>
<li>Architectural design patterns like Separation Of Concerns achieve scalability and reusability.</li>
</ul>
Besides showing how to apply these practices to CSS, I will explain why they make a positive impact on maintainability.
    </div>
    <div class='speaker'>Kristofer Walters</div>
    <div class='speaker_bio'>Kristofer is specialized in things happening inside Browsers. He started his career in software development during the Browser War between Microsoft and Netscape. Since then he has been working on web applications for startups, agencies and enterprises, among them some of Germany's biggest e-commerce sites. Despite being called the front-end guy, Kristofer can write Enterprise Java and fails miserably at Photoshop.
    </div>
</div>

<div class="talk" id="intro_clojure">
    <div class='title'>Intro til Clojure - det moderne spr&aring;ket for alle plattformer</div>
    <div class='abstract'>Spr&aring;ket Clojure har tatt verden med storm. For kun 3 &aring;r siden kom f&oslash;rste versjonen for
        JVM&#39;en, og i dag finnes implementasjoner b&aring;de for .NET og JavaScript.<br/><br/>I denne presentasjonen
        vil jeg introdusere Clojure som spr&aring;k, b&aring;de syntaks og semantikk. Jeg vil ogs&aring; vise p&aring; hvilke m&aring;ter spr&aring;ket
        skiller seg radikalt fra andre popul&aelig;re spr&aring;k.<br/><br/>Etter denne presentasjonen vil du f&aring; en forst&aring;else
        av hvorfor &quot;Clojurians&quot; &oslash;nsker at spr&aring;ket deres er tilgjengelig p&aring; alle platfformer, og jeg er
        temmelig sikker p&aring; at du kommer til &aring; &oslash;nske &aring; bruke spr&aring;ket selv.
    </div>
    <div class='speaker'>Alf Kristian St&oslash;yle</div>
    <div class='speaker_bio'>Alf Kristian er en engasjert og aktiv utvikler som hele tiden fors&oslash;ker &aring; fornye seg.
        Han har nesten 9 &aring;rs erfaring med utvikling, men fors&oslash;ker hele tiden &aring; utfordre det han allerede
        kan.
    </div>
</div>

<div class="talk" id="twitter_bootstrap">
    <div class='title'>Using Twitter Bootstrap for fun and profit</div>
    <div class='abstract'>Twitter Bootstrap is quickly becoming one of *the* most commonly used frontend
        frameworks used in Responsive Web Design Projects.<br/><br/>In this session we&#39;ll walk through this
        &quot;sleek, intuitive, and powerful front-end framework&quot; (as the makers of Bootstrap put it) and
        evaluate how Bootstrap can be used for acheiving the promises of &quot;faster and easier web
        development&quot;.<br/><br/>We&#39;ll
        also look into how Bootstrap was used efficiently as a vehicle for shortening parts of the design process in
        a recent website Project.
    </div>
    <div class='speaker'>&Aring;ke Järvklo</div>
    <div class='speaker_bio'>Web solutions specialist / EPiServer Developer / Senior Front End Guy and RWD
        Aficionado at Knowit Norrland<br/>Keen on Good web practices, Standards, Accessibility, Mobility &amp; Open
        Source
    </div>
</div>

<div class="talk" id="modular_javascript">
    <div class='title'>Hvordan strukturere og skrive modul&aelig;r JavaScript</div>
    <div class='abstract'>Selv om JavaScript har f&aring;tt sin renessanse i de senere &aring;rene er det forstatt mange som
        er skeptisk til &aring; gjennomf&oslash;re st&oslash;rre prosjekter i spr&aring;ket. I motsetning til mange andre
        programmeringsspr&aring;k
        har ikke JavaScript eksplisitt st&oslash;tte for &aring; definere moduler og avhengigheter mellom frittst&aring;ende deler.
        Nettopp dette er et vanlig argument blant skeptikere, n&aring;r JavaScript kodebaser vokser blir det
        vanskeligere
        og vanskeligere &aring; strukturere koden.<br/><br/>Er slike utsagn mangel p&aring; forst&aring;else for spr&aring;ket og
        &oslash;kosystemet rundt, eller har skeptikerne et gyldig argument?<br/><br/>Vi skal i denne presentasjonen se
        p&aring;
        noen m&aring;ter &aring; strukturere kode i &quot;vanilla&quot; JavaScript. Etter dette kommer vi til &aring; ta for oss
        to
        modulformater, AMD og CommonJS, som begge fors&oslash;ker &aring; formalisere modularisering av JavaScriptkode. Hva
        er
        forskjellen mellom de to? Er det noe hensikt &aring; ta de i bruk p&aring; mindre prosjekter, og hvilke verkt&oslash;y
        finnes
        det der ute som st&oslash;tter opp under disse? Til slutt kommer vi til &aring; se p&aring; hva vi kan forvente oss p&aring;
        dette
        omr&aring;det av neste JavaScript versjon.<br/><br/>Dette er en presentasjon for deg som er nybegynner i
        JavaScript men &oslash;nsker &aring; l&aelig;re mer om organisering av avhengigheter og strukturering av kodebase i
        JavaScript.
    </div>
    <div class='speaker'>Alfred Lysebraate</div>
    <div class='speaker_bio'>Alfred har jobbet som systemutvikler i Knowit i litt over 3 &aring;r og har p&aring; den tiden
        f&aring;tt
        glede av &aring; jobbe med b&aring;de frontend og backend. Etter mange s&oslash;vnl&oslash;se netter p&aring; jakt etter det perfekte
        webrammeverket p&aring; Javaplattformen har han n&aring; valgt &aring; fokusere innsatsen litt n&aelig;rmere browseren, nemlig
        en
        bedre forst&aring;else for JavaScript.
    </div>
</div>

<div class="talk" id="tenking">
    <div class='title'>Tenking om tenking</div>
    <div class='abstract'>Personlighetstyper, med spesiell fokus p&aring; introvert/ekstrovert og hvordan dette
        p&aring;virker probleml&oslash;sningsstrategien til den enkelte, inpass i arbeidsmilj&oslash; og kommunikasjon med de
        andre
        menneskene. <br/><br/>Det skal bli snakket om parprogramering og hvordan / hvorfor dette funker s&aring;
        d&aring;rlig
        for enkelte. Det skal bli snakket om hjernens system 1 og system 2, som i den intuitive versus den
        beviste
        informasjonsprosseseringen som skjer og efekter av dette p&aring; oppgavel&oslash;sning. <br/><br/>Det skal bli
        rakket
        ned p&aring; &aring;pent kontorlandskap, men kanskje en to formildende punker som taler for. <br/><br/>Grunnlaget
        for
        foredraget er bl.a. fra b&oslash;kene:<br/>Quiet: The Power of Introverts in a World That Can&#39;t Stop
        Talking<br/>The Highly Sensitive Person<br/>Peopleware<br/>Why Zebras Don&#39;t Get Ulcers<br/>Intuition:
        Its Powers and Perils<br/>Thinking, Fast and Slow
    </div>
    <div class='speaker'>Tanja Gruschke</div>
    <div class='speaker_bio'>Tanja er ansatt i Knowit Objectnet som Java-utvikler. Hun har tidligere jobbet
        som
        stipendiat / forskningsassistent ved Simula–senteret. Tanja er kreativ, l&oslash;sningsorientert og bidrar
        alltid
        positivt i prosjekter. Tanja er interessert i b&aring;de &aring; f&aring; overordnet og detaljert oversikt over
        prosjektet hun
        er p&aring; for &aring; kunne bidra til at arbeidsprosessen hele tiden blir optimalisert til oppgaven som skal
        l&oslash;ses.
    </div>
</div>

<div class="talk" id="alm_and_agile">
    <div class='title'>Why ALM and Agile is a perfect match</div>
    <div class='abstract'>Application Lifecycle Management (ALM) is concept that has become more and
        more popular
        the last 5+ years. Companies like Microsoft, HP, IBM, Atlassian and others all have their
        solution for the
        ALM area. This session will focus on the cornerstones of ALM and what impact this will have on
        our projects.
        The main focus will be on ALM using TeamFoundation Server 2012 and Visual Studio 2012, but the
        concept is
        really platform independent. We will cover the following cornerstones of ALM:<br/><br/> •
        Traceability<br/>
        • Visibility<br/> • High level process automation<br/> • Collaboration<br/> • Work planning<br/><br/>Different
        agile methods have also become more and more popular over the years. Scrum, Kanban, XP and
        others are
        frameworks and practices that are used to increase quality in many organizations. What is great
        is that the
        agile methods goes so well with ALM. Many of the practices in agile map very well into the
        cornerstone of
        ALM. This session will discuss how agile maps into ALM.
    </div>
    <div class='speaker'>Joachim Rossberg</div>
    <div class='speaker_bio'>Joachim Rossberg has worked as an information technology consultant since
        1998. He is
        primarily a Scrum Master and Product Owner but has an extensive history as a system
        developer/designer as
        well. His specialties include project management, Scrum, ALM, development processes, and Visual
        Studio.
        Joachim is now working for Knowit System Development in Gothenburg, Sweden.
    </div>
</div>

<div class="talk" id="java_8_rescue">
    <div class='title'>Java 8 to the rescue!?</div>
    <div class='abstract'>Java 8 will finally deliver us to the promised land of functional
        programming! So can
        we stop worrying now about learning Scala and Clojure and the other new kids on the
        block?<br/><br/>We&#39;ll
        look at what powers the new features such as Lambdas, Default Methods and Streams give us,
        as well as what
        Java is still lacking compared to other functional languages on the JVM.
    </div>
    <div class='speaker'>Fredrik Vraalsen</div>
    <div class='speaker_bio'>Fredrik&#39;s main interest as a developer is languages, techniques,
        methods and tools
        that can improve efficiency, quality and not least the joy of programming. The last couple
        of years his
        focus has been on alternative JVM languages like Scala and Clojure, in particular the
        functional programming
        aspects. He likes to find ways to apply these principles in his daily work as Java
        developer. Fredrik has
        over 10 years of experience as a software developer working with Java EE, Swing client
        applications and
        Java/C++ on mobile devices.
    </div>
</div>

<div class="talk" id="webutvikling_clojure">
    <div class='title'>Webutvikling med Clojure</div>
    <div class='abstract'>Clojure er en dialekt av lisp som kj&oslash;rer p&aring; JVM&#39;en.<br/>
      En indikasjon p&aring; at tiden
      er inne for &aring; ta dette programmeringsspr&aring;ket p&aring; alvor er at det i mars 2012 rykket
      opp til adopt p&aring; thoughtworks technology radar.<br/>
      Etter en lang tid med EJB l&oslash;sninger og tunge applikasjonsservere er mange
      n&aring; p&aring; jakt etter lettere arkitektur.<br/>
      Ring er et Clojure biblotek som tilbyr en http abstraksjon.<br/>
      Dette bibloteket gj&oslash;r det mulig &aring; bygge webl&oslash;sninger med fokus p&aring; domenet og
      ikke tunge rammeverk.
    </div>
    <div class='speaker'>Tom Christian Woods</div>
    <div class='speaker_bio'>Jeg er lidenskapelig opptatt av funksjonell programmering. Det
        begynte i 2006 med
        OCaml og etter det var det ingen vei tilbake. Jeg har hovedfag i parallell
        programmering fra UiB. Min
        f&oslash;rste jobb var i Oslo og jeg har n&aring; jobbet snart 8 &aring;r med systemutvikling. Jeg
        begynte i knowit
        for er &aring;r siden og jobber for Skatteetaten p&aring; MAG prosjektet.
    </div>
</div>

<div class="talk" id="minding_security">
    <div class='title'>Minding Security</div>
    <div class='abstract'>The end user trust us to keep them out of harms way, and our clients to ensure that someones trust in their good name cannot be easily exploited by a malevolent attacker. How is it done in practice, and what are the possible consequences of neglecting proper care in implementing code?<br><br>
Jumping off the OWASP Top Ten Project, we'll discuss some practical strategies for mitigating risks when coding, and present some tools to help us on the way. We will aim to learn more about the anatomy of current threats to web security, such as code injections, improper handling of user credentials and more .
    </div>
    <div class='speaker'>Oskar Lindberg</div>
    <div class='speaker_bio'>Agile systems developer primarily with C# and ASP.NET and some 10 years experience in consulting. Not a security expert, but one who strives to improve and raise standards.<br><br>
Prefers flexibility over re-usability, spaces over tabs, whiskey over wine, and all your base are belong to us.
    </div>
</div>

<div class="talk" id="intro_nservicebus">
    <div class='title'>An introduction to NServiceBus</div>
    <div class='abstract'>One of the problems with the distributed systems being built
        today is that they are
        sometimes fragile and unstable, and it is quite time consuming to code your own
        re-try logic. Have you heard
        about technologies like NServiceBus targeted at solving these problems, but have
        not yet dared to take
        advantage of them ? Then this workshop might be for you. If you choose to attend
        you will learn how to
        implement one-way messaging using NServiceBus. Bring your laptop.<br/><br/>The
        workshop will last
        approximately two hours.
    </div>
    <div class='speaker'>Anders R&oslash;rvik</div>
    <div class='speaker_bio'>Senior developer in Knowit Reaktor
        Kyber. Mostly working within banking and finance.</div>
    <div class='speaker'>Kjell Iver Breist&oslash;l</div>
    <div class='speaker_bio'>Fulltime
        developer at Knowit Reaktor
        Bergen, develops applications for the bank and finance industry.</div>
    <div class='speaker'>Christoffer Dahl Kingsrud</div>
    <div class='speaker_bio'>Developer
        at Knowit Reaktor Bergen. I spend my working days developing Microsoft Web
        applications for several finance
        companies in Scandinavia. I am also a co-organizer at Norwegian .Net User Group
        in Bergen.</div>
</div>
</div>
</div>

<div class="row" id="workshops">
<div class="span9">
<div class="talk" id="fun_nodejs">
    <div class='title'>Fun With Node.js</div>
    <div class='abstract'>Programming in Node.js is a lot of fun. It&#39;s APIs are
        small and tremendously
        powerful and expressive. At the same time its community and open-source
        modules are growing at an enormous
        pace currently leaving users with 20000 modules available.<br/><br/>All of
        that means that we can do a lot
        of fun things with Node.js from controlling quad-copters and CNC machines to
        building scalable real-time
        websites like Trello and mobile apps like Voxer and Gather.<br/><br/>In this
        workshop I will hack, and you
        will hack. We will try to build something fun and have fun doing
        it.<br/><br/>Length: 90min
    </div>
    <div class='speaker'>David Ed Mellum</div>
    <div class='speaker_bio'>David is a systems developer for Knowit Reaktor Kyber
        with a love for simple, concise
        and elegant problem solving. He&#39;s worked doing everything from devops to
        building real-time web-apps,
        HTML5 mobile apps and CMS-based sites. He&#39;s a huge open source advocate
        contributing to several projects
        and maintaining several of his own projects.
    </div>
</div>

<div class="talk" id="maintainable_ruby">
    <div class='title'>Maintainable Ruby on Rails</div>
    <div class='abstract'>Since Rails 3.2, Engines has become the standard way
        of splitting application
        functionality into smaller isolated pieces. A Rails Engine can contain
        the same functionality as a normal
        Rails application, with the added benefit of being distributable as a
        gem which can be plugged into your
        applications. This is key for both creating reusable components and
        separating concerns within larger
        applications.<br/><br/>Workshop Goal:<br/>Get familiar with using and
        creating Rails Engines, and understand
        how they can help improve the maintainability aspects of your apps.
        We’ll create a small application which
        will demonstrate how they work, starting by using popular 3rd party
        engines, before creating our own engine.
        We’ll talk about what kind of functionality fits best within an engine,
        and provide general advice on best
        practices.<br/><br/>Agenda:<br/>- What’s a rails engine and why would
        you want to use them?<br/>- Best
        practices for creating engines<br/>- Using 3rd party engines within your
        application<br/>- Creating your own
        engine<br/>- Wiring it all together<br/>- Final thoughts /
        recommendations<br/><br/>Participant
        requirements: Laptop with at least Ruby 1.9.3 (or greater)
        installed.<br/><br/>Duration: 3 hours.
    </div>
    <div class='speaker'>Bj&oslash;rn Arild M&aelig;land, David Mellum</div>
    <div class='speaker_bio'>Bj&oslash;rn and David works for Knowit Reaktor Kyber and
        are currently consulting at Vimond
        Media Solutions where we write large Rails apps.
    </div>
</div>

<div class="talk" id="refactoring_exercise">
    <div class='title'>Refactoring exercise</div>
    <div class='abstract'>Do you write code that is easy to read and
        understand for others? How understandable is
        your code when you come back 6 months later?<br/><br/>Practise your
        refactoring skills with this C#
        programming exercise. You will be given an exercise from real
        production code where your task is to improve
        its readability and possibly the ability of the code to be extended
        or changed in the future. <br/><br/>Anonymous
        answers will be discussed afterwards, and conclusions from previous
        runs of the same exercise will be
        explained. Total time; 2 hours.
    </div>
    <div class='speaker'>Halvard Hages&aelig;ther</div>
    <div class='speaker_bio'>Senior developer at Knowit Bergen. 10+ years of
        experience building enterprise
        solutions and with an special interest in code quality.
    </div>
</div>
</div>
</div>
</section>
<br/>

<hr>
<footer id="footer">
    <div class="row-fluid">
        <div class="span12">
            <div class="row-fluid">
                <div class="span2">
                    <p>Kontakt <a href="mailto:kds@knowit.no">kds@knowit.no</a></p>

                    <p><img src="images/knowit_logo_white_rgb_scaled.png"/></p>
                </div>
                <div class="span7">
                    <div class="row-fluid">
                        <div class="pull-right"><a href="#">Tilbake til toppen</a></div>
                        <br/><br/>

                        <div class="pull-right">
                            <a class="social" href="http://twitter.com/intent/tweet?text=&hashtags=kds2013"><img
                                    class="social_icon" src="images/twitter.png"/></a>
                            <a class="social" href="http://www.facebook.com/knowitnorge"><img class="social_icon"
                                                                                              src="images/facebook.png"/></a>
                            <a class="social" href="http://www.linkedin.com/company/knowitab"><img class="social_icon"
                                                                                                   src="images/linkedin.png"/></a>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</footer>
</div>
</body>
</html>
