{"program":{"tags":["tools and techniques","cloud","architecture","devops","agile","ai","case","framework","test","research","way of work"],"days":[{"day":"Friday","slots":[{"timeStart":1100,"timeEnd":1115,"type":["Intro - Room 17+18"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1130,"timeEnd":1230,"type":["Lunch"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1230,"timeEnd":1300,"type":["Short presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":25,"language":"English","difficulty":"Beginner","title":"Rise of no-code platforms: an introduction to building apps without opening your IDE","type":"Short presentation (30 minutes)","description":"No-code tools and platforms are evolving and they are not terrible anymore. You are finally able to create good-quality, dynamic websites and mobile applications without the need to write a single line of code.\nIn this presentation, I will show you two of the best tools to create Beautiful dynamic websites, and custom designed mobile applications with api calls inside it. The goal of this talk is to show how far we have come to convert our designs directly into actual software.","speakers":[{"name":"Amir Roosta","info":"Amir is a Software developer from Knowit Experince, Malmö who likes to work with almost everything. So far he had his hands dirty with Cloud and Backend technologies, frontend web development and Google's side of mobile technologies, namely Android and Flutter. He usually tries to play with cool new technologies that makes the development of software systems easier, less time consuming and more reliable."}],"tags":["tools and techniques"]}]},{"name":"Room 16","talks":[{"talkId":19,"language":"English","difficulty":"Beginner","title":"Considering taking a cloud certification?","type":"Short presentation (30 minutes)","description":"Through the last two years more than 50 people have earned cloud certifications in Norway through several training programs. Join this session to learn about the different certifications and how we have structured the programs.","speakers":[{"name":"Øyvind Eikeland","info":"Øyvind has worked as software developer, architect and manager in Accenture, Microsoft and Visma prior to joining Knowit three years ago. For the last ten years Øyvind has worked on cloud projects, and he now servers as CTO and Head of Cloud in Knowit Amende. The weeks are filled with technology and partner activities, building competence programs like Knowit Academy, and presales with customers. "}],"tags":["cloud","architecture","devops"]}]},{"name":"Room 17","talks":[{"talkId":2,"language":"English","difficulty":"Intermediate","title":"We stretched Agile to its limits and this is what we found","type":"Short presentation (30 minutes)","description":"Agile Software Development Manifesto was formed in 2001. In year 2013, Knowit established its first Innovation Zone and took Agile for a test drive! About 8 years and numerous client projects later, Innovation Zone is now a global team (A big distributed Agile team across countries). Agile has been the Software Development process of choice but it is not without its flaws. Learn about Innovation Zone’s journey in connection with Agile methods over the years!","speakers":[{"name":"Irfan Khalid","info":"Irfan Khalid leads Knowit's Innovation Zone, our own Incubator, for Colleagues, Partners and Academia to collaborate in an agile creative environment discovering potential solutions for a sustainable tomorrow. It has helped over 60 start-ups and multinationals in exploring the potential of emerging technologies in their businesses. Irfan has a background in software development and product management. He is a Certified Innovation Leader."}],"tags":["agile"]}]},{"name":"Room 18","talks":[{"talkId":30,"language":"English","difficulty":"Beginner","title":"Flomrespons - Data driven flood forecasting in Norway ","type":"Short presentation (30 minutes)","description":"The effects of floods can be devastating to human quality of life, and sometimes even deadly. While there is often little we can do to stop a pending flood, early and accurate forecasts can significantly reduce the destructive impact. \n\nThe Research Council of Norway (Norges Forskningsråd) is funding a pre-commercial project called “Flomrespons” which aims to develop better local flood forecasting and warning systems.\n\nKnowit, together with Pipelife, NTNU (Norwegian University of Science and Technology) and Telenor has been for the past year working on a solution using low-energy electronics, Narrowband IoT and machine learning. ","speakers":[{"name":"Jens Markussen","info":"Developer and consultant with a fondness for computers. Experienced with computer graphics and machine learning, and likes to tinker with microcontrollers in his spare time"}],"tags":["ai"]}]}]},{"timeStart":1300,"timeEnd":1315,"type":["Break"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1315,"timeEnd":1415,"type":["Long presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":15,"language":"English","difficulty":"Intermediate","title":"From legendary code to bleeding edge, a developer journey","type":"Long presentation (60 minutes)","description":"Join me as I share my learnings from bringing an old codebase from a mix of jQuery and custom framework code to an almost bleeding edge, enterprise grade client-side application. Anecdotes, failures and \"almost rage-quit\" moments.","speakers":[{"name":"Poul Holger Hjorth Hansen","info":"Happy father of two. Senior frontend developer from the Creuna office in Aarhus, Denmark. \n\nI've worked with frontend full-time for 5-6 years with Angular on an enterprise level. \nI love all things web and have taken a liking to web-components which I advocate as much as I can.\n"}],"tags":["case"]}]},{"name":"Room 16","talks":[{"talkId":24,"language":"English","difficulty":"Intermediate","title":"XState: an introduction to state management with finite state machines","type":"Long presentation (60 minutes)","description":"There are a ton of libraries and patterns to do state management in a React application. However, using actual state machines isn't usually on the list.\nIn this presentation, I will introduce XState, which is a javascript finite state machine and state charts library and then I will show you how you can utilize it to make your state management solution much more convenient. Moreover, I will demonstrate how you can visualize and even share your application's state logic using state charts.","speakers":[{"name":"Amir Roosta","info":"Amir is a Software developer from Knowit Experince, Malmö who likes to work with almost everything. So far he had his hands dirty with Cloud and Backend technologies, frontend web development and Google's side of mobile technologies, namely Android and Flutter. He usually tries to play with cool new technologies that makes the development of software systems easier, less time consuming and more reliable."}],"tags":["framework"]}]},{"name":"Room 17","talks":[{"talkId":36,"language":"English","difficulty":"Intermediate","title":"Business aligned availability design in the Cloud","type":"Long presentation (60 minutes)","description":"Availability is not relevantly designed only around 9's. Learn how to design and implement architectures in the cloud according to Well-Architected principles. Ensure that the implementation has meaningful outcomes in actualized service levels and are aligned with the business case and requirements of your client.","speakers":[{"name":"Rolf Koski","info":"CTO for Knowit Cloud Partnerships and AWS Hero & AWS Partner Ambassador. Cloud advisor and evangelist, specifically in cloud strategy and governance related topics. Holds multiple highest level certifications in AWS. Community leader at AWS Community Nordics."}],"tags":["cloud","architecture","devops"]}]},{"name":"Room 18","talks":[{"talkId":27,"language":"English","difficulty":"Intermediate","title":"Azure Well Architected Review","type":"Long presentation (60 minutes)","description":"In this workshop, we will deep dive into The Azure Well-Architected Review that is designed to help evaluate workloads against the latest set of Azure best practices. It provides a suite of actionable guidance that can be used to improve workloads in the areas that matter most to the business. \n\nWe will review the 5 pillars of Azure Well-Architected Framework and how the review can help ever-growing complexity of technology requirements while the business or pratice grow & change over time.\n","speakers":[{"name":"Firoz Basha Shaik","info":"Firoz Basha Shaik is a Cloud Solution Architect with focus on multi-cloud architecture on AWS & Azure. Firoz has a background in architecture and consulting from large projects in the data center and in the cloud, and has received several certifications at, among others, AWS & Azure in recent years. "}],"tags":["cloud","architecture","devops"]}]},{"name":"Room 19+20","talks":[{"talkId":12,"language":"English","difficulty":"Intermediate","title":"Service Design - Introduction for non-service-designers","type":"Long presentation (60 minutes)","description":"I will give an introduction to a way we work with service design. It is an introduction to the subject and the tools used. All set in system so that it creates value and is adaptable to most projects.","speakers":[{"name":"Øyvind Brande-Lien","info":"Øyvind Brande-Lien is a UX Lead Designer and Service Designer for Knowit Amende. He balances his time between projects and managing the UX knowledge and activities for the UX department at Knowit Amende in Norway."}],"tags":["tools and techniques"]}]}]},{"timeStart":1415,"timeEnd":1445,"type":["Fika"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1445,"timeEnd":1515,"type":["Short presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":33,"language":"English","difficulty":"Intermediate","title":"Content modelling with Sanity","type":"Short presentation (30 minutes)","description":"A look at how you can quickly and accurately model your data using Sanity.\n\nThis talk will take you through a live JAM stack site, using Gatsby, Sanity and Azure Functions to create a modern and performant site. We will have a look at what Sanity is all about, how to model content, and some cool things you can do to make your clients love you!","speakers":[{"name":"Erik Heumrønningen","info":"Erik has worked as a full-stack developer for almost 15 years, with clients like TDC, If and Innovation Norway. He works at Knowit Experience Oslo where he is competence lead for solution architecture. Erik finds just as much joy in writing neat css as beautiful api’s."}],"tags":["framework"]}]},{"name":"Room 16","talks":[{"talkId":29,"language":"English","difficulty":"Beginner","title":"Debugging techniques","type":"Short presentation (30 minutes)","description":"We create technology and we aim to develop “zero-defects” software products that correspond to the necessities of our customers, but when writing code, we also, unwillingly and unwantedly, create bugs. As we tackle the errors as developers: what skills should we use, what techniques we can apply to fix the errors, and what kind of mindset we should have? In this presentation, I will try in brief to suggest answers to these questions.  ","speakers":[{"name":"Alexandra Dobrescu","info":"I have been a full-stack developer for almost 15 years working with .Net technologies in combination with different frontend libraries, and I have contributed to the development of various web solutions for customers in different domain of activity. In my spare time, I am the mother of two cheeky boys, and I enjoy dancing ballet."}],"tags":["tools and techniques"]}]},{"name":"Room 17","talks":[{"talkId":6,"language":"English","difficulty":"Intermediate","title":"TensorFlow Lite for Microcontrollers","type":"Short presentation (30 minutes)","description":"Small microcontrollers and IoT-units are everywhere and when connected to different kinds of electronic sensors are capable of collecting all kinds of interesting data about their surroundings. However, if we wish to use this data as input to a machine learning model hosted somewhere on the internet we are faced with several challenges including increased battery usage and privacy concerns. What if we instead could run our model directly on the device itself? \n\nIn this presentation we will go through all steps necessary to run TensorFlow models on a microcontroller using TensorFlow Lite, with a live demonstration using a ESP32 camera module.","speakers":[{"name":"Jens Markussen","info":"Developer and consultant with a fondness for computers. Experienced with computer graphics and machine learning, and likes to tinker with microcontrollers in his spare time"}],"tags":["ai"]}]},{"name":"Room 18","talks":[{"talkId":18,"language":"English","difficulty":"Beginner","title":"Moving to the cloud through the Cloud Adoption Framework","type":"Short presentation (30 minutes)","description":"Mastering the cloud requires expertise, experience, and sometimes even organizational change. AWS, Microsoft Azure and GCP have all developed their own Cloud Adoption Frameworks. The Cloud Adoption Framework helps customers migrate and adopt the cloud in the best possible way. Join this session to learn more about the CAF and how you can apply it to your customers.","speakers":[{"name":"Øyvind Eikeland","info":"Øyvind has worked as software developer, architect and manager in Accenture, Microsoft and Visma prior to joining Knowit three years ago. For the last ten years Øyvind has worked on cloud projects, and he now servers as CTO and Head of Cloud in Knowit Amende. The weeks are filled with technology and partner activities, building competence programs like Knowit Academy, and presales with customers. "}],"tags":["cloud","architecture","devops"]}]}]},{"timeStart":1515,"timeEnd":1530,"type":["Break"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1530,"timeEnd":1700,"type":["Workshops"],"rooms":[{"name":"Room 19+20","talks":[{"talkId":1,"language":"English","difficulty":"Beginner","title":"How children learn testing with dragons","type":"Workshop (90 minutes)","description":"There are fun ways to learn software testing. Kari presents how children learn testing through his fantasy book Dragons Out and extrapolates what that means for adults learning to test. There's also an exploratory testing exercise. Kari released the fantasy book in Finnish in 2020 and in English in 2021. He recently won the most prestigious software testing recognition in Europe due to this, the EuroSTAR Software Testing Excellence Award. Join the session to hear out the book story, learn some more interesting ways to test, and do some cool exploratory testing! More information www.dragonsout.com ","speakers":[{"name":"Kari Kakkonen","info":"Mr. Kari Kakkonen has M.Sc. in from Aalto University (aalto.fi). He has also studied in University of Wisconsin-Madison (wisc.edu) in United States. He has ISTQB Expert Level Test Management Full, Agile Tester, Test Automation Engineer, Scrum Master, SAFe and DASA DevOps certificates, and works mostly with agile testing, lean, test automation, DevOps and AI. He has in testing since 1996. \nKari Kakkonen is author and CEO of Dragons Out Oy, creating a fantasy book to teach software testing to children. Kari Kakkonen is working in Finland at Knowit (knowit.fi), which is a Nordic ICT services company known for testing consultancy and software development, and other innovative ICT related services. \nKari is Treasurer of Finnish Software Testing Board FiSTB (fistb.fi), ISTQB Executive committee 2015-2021. Kari has been included in IT–magazine “Tivi” 100 most influential people listing. Kari is co-author of Agile Testing Foundations –book.\nKari is a singer, snowboarder, kayaker, husband and dad.\n"}],"tags":["test"]}]}]},{"timeStart":1530,"timeEnd":1600,"type":["Short presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":37,"language":"English","difficulty":"Beginner","title":"Best Practice Onboarding","type":"Short presentation (30 minutes)","description":"Proper onboarding makes a world of difference for new employees, whether they are new to your organization or to your team. This presentation summarizes what we've learned from improving our onboarding in Knowit Experience Bergen, where we also collaborate with Sintef and other Knowit firms to research onboarding.","speakers":[{"name":"Patrick Monslaup","info":"Patrick Monslaup is a technical manager (fagleder), teamlead and full-stack developer in Bergen, where he works on facilitating professional development, onboarding, and collaboration in general. He is especially interested in improving how we work together, often focusing on soft skills, team dynamics, process and code quality."}],"tags":["research","way of work"]}]},{"name":"Room 16","talks":[{"talkId":10,"language":"English","difficulty":"Intermediate","title":"Goto: Keeping the magic alive","type":"Short presentation (30 minutes)","description":"Goto is a magic open source terminal tool that opens the places you go to everyday when working with your projects. Like code editors in a specific folder -  jira, code in terminal and more. Built with python and bash/zsh It was created by me in 2017. This talk is going to step into the maintenance aspect of running a open source project where the surrounding technology and supported platforms changes. Python2 is now dead (finally)\n\nhttps://github.com/technocake/goto\n\nIt will also feature a teasing demonstration of goto - and delve into how we develop automated interaction tests for it. ","speakers":[{"name":"Robin Garen Aaberg","info":"Developer with high focus on creating reliable systems through quality through every step in the process. Also a composer and contributing a bit to the open source community with the project Goto. https://github.com/technocake/goto"}],"tags":["tools and techniques"]}]},{"name":"Room 17","talks":[{"talkId":22,"language":"English","difficulty":"Intermediate","title":"A little bit of everything all of the time: An introduction to recommender systems","type":"Short presentation (30 minutes)","description":"Recommender systems are found everywhere in our digital lives. They help us find movies, improve our searches, place our ads and filter our social media. But how do they work? This presentation will provide an introduction on how recommender systems work, main implementation methods and their use cases.\n\nThis presentation is aimed at all who are curious about recommender systems and machine learning with no previous knowledge of ML or recommender systems required, and will provide an excellent starting point before delving deeper into the topic!\n","speakers":[{"name":"Johnny Bjånesøy","info":"Johnny Bjånesøy is a data scientist and full-stack developer at Knowit Experience Bergen deeply involved with the AI Group. His master degree in information science centered around multi-list presentation of recommender systems and how to introduce user control into the mix. He’s an otherwise swell guy"}],"tags":["ai"]}]},{"name":"Room 18","talks":[{"talkId":31,"language":"English","difficulty":"Intermediate","title":"React ❤️ .Net","type":"Short presentation (30 minutes)","description":"How we marry React with .Net to create an awesome experience for both Frontend and Backend development.","speakers":[{"name":"Adrian Edlund","info":"Adrian Edlund is a Senior Developer from Oslo. He has been working for the past 6 years on various Episerver and .Net projects, and loves the interaction space that exists between the Frontend and Backend code."}],"tags":["framework"]}]}]},{"timeStart":1600,"timeEnd":1615,"type":["Break"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1615,"timeEnd":1715,"type":["Short presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":21,"language":"English","difficulty":"Intermediate","title":"Modernizing legacy websites using WebComponents, StencilJS and Storybook","type":"Short presentation (30 minutes)","description":"How can we modernize a legacy website to be using new web technologies without running a looong refactoring project, rewriting it all from scratch? WebComponents and StencilJS to the rescue. WebComponents has a super-power that allows you to sprinkle them in wherever you need them, and the best part is - they're built into the browser, and because of that, they're super fast.","speakers":[{"name":"Mikkel Rom Engholm","info":"I'm Mikkel Rom, Lead Frontend Developer in Knowit Experience DK. In my sparetime I co-host CodeSplitters podcast, a podcast about web development."}],"tags":["framework"]},{"talkId":4,"language":"English","difficulty":"Beginner","title":"Dates and time - fun things and best practices","type":"Short presentation (30 minutes)","description":"Doing dates in programming correct is hard. A talk about dates and timezones and daylight savings, different representations of datetime. Some stuff about best practices. Cover multiple languages, JS, C#, Java/Kotlin and maybe more.\r\n","speakers":[{"name":"Tom Hellström","info":"System architect at Knowt Invativa. Been programming and building stuff for on prem, web, mobile and cloud for the last 20 years."}],"tags":["tools and techniques"]}]},{"name":"Room 16","talks":[{"talkId":46,"language":"English","difficulty":"Intermediate","title":"Taking a page from functional programming: how to burn spaghetti and become 20% cooler (case study)","type":"Short presentation (30 minutes)","description":"A case study of how immutability allowed us to trim down code complexity, add parallelization and - of course - speed up execution time of one of our customers' core components","speakers":[{"name":"Michał Woźniczak","info":"Long time developer of varying combinations of Python, modern JS, and occasional niche tech. Built all sorts of things: websites, through APIs and cloud things, to command-line tools. Knows his way around CI/CD, and will rant about Jenkins if reminded it still exists. Possibly secretly a wizard (unconfirmed)."}],"tags":["tools and techniques"]}]},{"name":"Room 17","talks":[{"talkId":11,"language":"English","difficulty":"Intermediate","title":"Pitfalls when Scaling Agile","type":"Short presentation (30 minutes)","description":"More and more organizations are scaling their agile initiatives, using SAFe, LeSS or other frameworks. Some organizations are successful and some struggle with this. What are common pitfalls? How can we avoid doing the same mistakes again?","speakers":[{"name":"Daniel Borgentun","info":"Daniel works with improving organisation, change management and development flow optimization within product development area.\r\nHe has more than 20 years of experience within automotive, telecom and IT business where he has been working with everything from change management to systems architecture\r\n\r\nIn latest years, Daniel is focusing on Organization for Speed, mostly by helping organizations to scale up their lean and agile initiatives."}],"tags":["agile","way of work"]},{"talkId":35,"language":"English","difficulty":"Beginner","title":"Garmeres - Developing a website in Sámi","type":"Short presentation (30 minutes)","description":"When I made the website of the organisation named Garmeres I came over several challenges: Their requirement of supporting multiple Sámi languages as well as a high degree of flexibility in content language drastically narrowed down which CMS-services could be used. SEO was also a challenge because Google does not support all of the Sámi language codes, and when I ran Lighthouse tests none of the Sámi language codes were recognised at all.\n\nThe Sámi languages are endangered by extinction, and unfortunately there are few to none good examples of best practices for developing websites supporting Sámi languages. I wish to speak about the challenges I met developing garmeres.com and how I solved them, with the hope of giving Sámi languages a place in the professional environment of frontend development.","speakers":[{"name":"Levi Sørum","info":"Levi Sørum is a full-stack developer who graduated NTNU march 2021 with a masters degree in computer science. He is speaks North-Sámi and is an active board member of the volunteer Sámi LGBTQ+-organisation named Garmeres, which name is the Southern-Sámi word for \"pride\"."}],"tags":["case"]}]},{"name":"Room 18","talks":[{"talkId":45,"language":"English","difficulty":"Beginner","title":"Automatic disease detection with the use of Cloud Computing - practical Machine Learning applications","type":"Short presentation (30 minutes)","description":"Artificial Intelligence (AI), which mimics human cognitive functioning, has revolutionized many industries, including medicine. Advances in technology, including increased computational power, more efficient hardware, and the development of deep learning algorithms, have led to the emergence of several AI applications in endoscopy. This work presents the results of the Automatic Disease Detection system created with the Azure Cognitive Services as the practical application of Machine Learning with Cloud Computing.","speakers":[{"name":"Adam Dziomdziora","info":"Adam is a Senior Software Engineer, working as a full-stack developer with .Net technologies and ReactJS. Also, he is an internal technology trainer and Microsoft Certified Trainer. Simultaneously, Adam is a Ph.D. candidate at Interdisciplinary Doctoral School @ the Lodz University of Technology. Co-author of a voice-controlled drawing Arduino prototype. Privately a happy husband, a proud father of two sons, and a Catholic believer."}],"tags":["ai"]},{"talkId":20,"language":"English","difficulty":"Beginner","title":"Follow up: Machine Learning in the underwater domain","type":"Short presentation (30 minutes)","description":"Follow up on presentation at KDS 2019. Resulta from own work and R&D Project sponsored by Defence Material Administration ","speakers":[{"name":"Jonas Ekström Berg","info":"Jonas Ekström Berg is a Senior Consultant and technically focused CEO for Knowit Defence Technology. He has 25 years of experience in System Development from the Defence and Telecom field in roles ranging from Software Developer, Tester, Systems Engineer and Project Manager. Jonas enjoys exploring new technologies to understand how they can help solving real world problems. Outside work Jonas is a volunteer Tug boat Captain and Maritime Educator."}],"tags":["ai"]}]}]},{"timeStart":1715,"timeEnd":1730,"type":["Break"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1730,"timeEnd":1830,"type":["Open Space"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":2000,"timeEnd":2230,"type":["Dinner"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]}]},{"day":"Saturday","slots":[{"timeStart":900,"timeEnd":930,"type":["Lightning talks & Short presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":32,"language":"English","difficulty":"Beginner","title":"Face Your Emotions -  An online multiplayer social game built with Amazon Rekognition AWS","type":"Lightning talk (10 minutes)","description":"Face Your Emotions is an online multiplayer social game built with Amazon Rekognition AWS. The game is made for one to ten people, in which the participants should express three random feelings for the camera on time. Amazon Rekognition is a deep learning-based image and video analysis service and will analyse your face and find facial landmarks such as the position of eyes, and detect emotions, for example, appearing happy or sad. The game could be played both in real world (adopted to two screens) as well as online. ","speakers":[{"name":"Bartosz Libner","info":"Bartosz Libner is an innovation leader with strong passion for improving quality of people’s lives, automating boring tasks and constantly putting his skills to best use. In his current role he is focusing on running innovation initiatives and leading innovation projects. His 5+ years of experience in Software Development and interest in Machine Learning enable him to work with broad spectrum of projects for different customers. He is always focused on delivering great value to end users."}],"tags":["ai"]},{"talkId":48,"language":"ERROR! No language provided.","difficulty":"ERROR! No difficulty provided.","title":"Break","type":"Lightning talk (10 minutes)","description":"ERROR! No description provided.","speakers":[],"tags":[]},{"talkId":47,"language":"English","difficulty":"Intermediate","title":"Is my train arrive on time?","type":"Lightning talk (10 minutes)","description":"The project has been initiated in order to provide more accurate arrival time for the train passengers based on machine learning platform from Train Brain and Facebook Chat-bot.","speakers":[{"name":"Shaho Sadeghi","info":"Shaho is Enterprise Architect in the cloud area. Combination of telecom experience and project management skill help him to fulfill his role."}],"tags":["ai"]}]},{"name":"Room 16","talks":[{"talkId":8,"language":"Norwegian","difficulty":"Beginner","title":"Brukeropplevelse i Unix-terminalen – en tilvenningsprosess eller dårlig design?","type":"Lightning talk (10 minutes)","description":"Unix-terminalen er selveste terminalen: Du finner varianter av den for Linux, Mac og Windows. Den er utbredt, men også beryktet for å være vanskelig å mestre. Hva er det som gjør at du får et dopaminrush når du en sjelden gang klarer å gjøre noe riktig på første forsøk?\n\nDenne lyntalen bruker UX-teori til å forklare hvorfor Unix-terminalen er så uhåndterlig og hva som kunne vært gjort bedre.","speakers":[{"name":"Brede Kristensen","info":"Brede er en utvikler som har jobbet i oppstartsbransjen i flere år, men har nylig valgt en betraktelig mer stabil arbeidsplass som konsulent hos Knowit. Der jobber han med offentlige prosjekter hvor sluttbrukeren stadig er førsteprioritet. Han er opptatt av å forstå hva og hvorfor man skal ta i bruk ulike løsninger og verktøy. Han har vært heldig, på godt og vondt, med å få velge hvilke løsninger som ble tatt i bruk i forskjellige prosjekter. Disse valgene har hatt ulike konsekvenser, og disse erfaringene ønsker han å dele."}],"tags":["tools and techniques"]},{"talkId":49,"language":"ERROR! No language provided.","difficulty":"ERROR! No difficulty provided.","title":"Break","type":"Lightning talk (10 minutes)","description":"ERROR! No description provided.","speakers":[],"tags":[]},{"talkId":7,"language":"Norwegian","difficulty":"Beginner","title":"Dynamisk DNS med AWS Lambda og Route 53","type":"Lightning talk (10 minutes)","description":"Egen server hjemme sier du? Og eget domene? Bytter ISPen din IP hele tiden og du trenger en dynamisk DNS-tjeneste?\n\nJeg viser deg hvordan du enkelt og sikkert kan gjøre dette selv på AWS med et lite python-script, shell-script en cron-jobb og noen enkle AWS-tjenester.\n\nNB: Kode i slides.","speakers":[{"name":"Jan Henrik Gundelsby","info":"Jan. Henrik is the Head of R&D in Knowit Solutions Norway. Working on bridging the gap between academia and practice, focusing on digital transformation, large scale agile and platformization. Advocating community of practice and the life time education of consultants. Jan Henrik has over 20 years of experience as a developer, architect and technology manager in large projects and programs. And he loves AWS."}],"tags":["cloud","architecture","devops"]}]},{"name":"Room 17","talks":[{"talkId":5,"language":"English","difficulty":"Beginner","title":"Javalin: Simplified web framework for Java/Kotlin","type":"Lightning talk (10 minutes)","description":"Javalin is a simple and compact web framework for Java and Kotlin. It is not very well known, but is a up and coming framework, that is already being used in the educational sector. Javalin's main goals are simplicity, a good developer experience and \"interoperability\" between Java and Kotlin.\r\n","speakers":[{"name":"Tom Martin Roberg","info":"Tom Martin is a developer from Halden, Norway. In 2017-2020 he took a bachelor in design and development of IT-systems at the university college in Østfold. He moved up to Trondheim after his studies, to start working with Knowit Objectnet in Trondheim"}],"tags":["framework"]},{"talkId":50,"language":"ERROR! No language provided.","difficulty":"ERROR! No difficulty provided.","title":"Break","type":"Lightning talk (10 minutes)","description":"ERROR! No description provided.","speakers":[],"tags":[]},{"talkId":14,"language":"English","difficulty":"Beginner","title":"Quantum Playgrounds","type":"Lightning talk (10 minutes)","description":"Quick look at some freely accessible quantum computing environments.\nMainly StrangeWorks, IBMs, and Microsoft Azure Quantum workplace.\n","speakers":[{"name":"David Lund","info":"Developer with 38+ years in the branch and 23+ years at Knowit."}],"tags":["tools and techniques"]}]},{"name":"Room 18","talks":[{"talkId":28,"language":"English","difficulty":"Beginner","title":"Temporal databases","type":"Short presentation (30 minutes)","description":"The new SQL standard for temporal databases gives temporal versioning to tables - but why is it important?\n\nAnd why should IT consultants bother - it does not seem to be a big issue on the market?","speakers":[{"name":"Kent Gramer","info":"Senior Datawarehouse Consultant since 1998"}],"tags":["tools and techniques"]}]},{"name":"Room 19+20","talks":[{"talkId":40,"language":"Norwegian","difficulty":"Beginner","title":"How to facilitate high value digital workshops","type":"Short presentation (30 minutes)","description":"During the pandemic we all were forced to work and collaborate remotely for extended periods of time. During that period some of us got extended experience in planning, organizing and executing highly efficient and valuable digital workshops and meetings.\n\nIn this talk I will present some of the learning lessons and best practices we established at Knowit Objectnet in Oslo. I will talk about best practices, tools, tips, tricks and general guidelines for executing high value digital workshops and tie that together with insights from our research partners about what makes for efficient team collaboration in distributed teams.","speakers":[{"name":"Thomas Malt","info":"Thomas is the CTO at Knowit Objectnet with extensive experience as Enterprise Architect, Software Architect and Developer.\n \nHe as worked as Technical Director, Head of Engineering and Head of Department, for more than 8 years,  and with software development with responsibilities such as Chief Developer, Chief Architect and Project Manager for more than 20 years.\n \nThomas enjoys challenges, learning and continuously improving his skills. He's distinctly team oriented and have a strong commitment to Lean Software Development, Lean Startup, continuous improvement, and appreciative inquiry, building strong and empowered teams in the organisations he influence.\n "}],"tags":["agile"]}]}]},{"timeStart":930,"timeEnd":945,"type":["Break"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":945,"timeEnd":1015,"type":["Short presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":9,"language":"English","difficulty":"Beginner","title":"User interface regression testing - Is the time now?","type":"Short presentation (30 minutes)","description":"Development and testing. Automated UI-testing in the past. Why hasn't it worked. Going through Selenium, PhantomJS, Nightmare/Daydream. Why Playwright and a test-framework of your choosing will work. Show and tell.","speakers":[{"name":"Espen Klem","info":"Interaction designer w/ 25 years of Internet development experience. Frontend-coder + webdesigner turning Interaction designer and Service designer and going back to code on the side."}],"tags":["test"]}]},{"name":"Room 16","talks":[{"talkId":38,"language":"Norwegian","difficulty":"Beginner","title":"Knowit Research: Metrikker og onboarding i en hybrid arbeidshverdag","type":"Short presentation (30 minutes)","description":"Knowit i Oslo driver med forskning sammen med akademia (SINTEF)! Vi forteller i dette foredrag hvorfor og hvordan. Foredraget beskriver forskning som en sentral del av Knowits kompetanseutvikling. Vi oppsummerer hva forskningen vet om metrikker/måling av team frem til nå og forteller hvordan vi skal studere dette. I tillegg viser vi noen funn vi har gjort selv om onboarding i en hybrid arbeidshverdag.","speakers":[{"name":"Jan Henrik Gundelsby","info":"Jan. Henrik is the Head of R&D in Knowit Solutions Norway. Working on bridging the gap between academia and practice, focusing on digital transformation, large scale agile and platformization. Advocating community of practice and the life time education of consultants. Jan Henrik has over 20 years of experience as a developer, architect and technology manager in large projects and programs. And he loves AWS."},{"name":"Tor Sporsem","info":"Tor Sporsem is a researcher at SINTEF Digital and studies organizations that undergo digital transformations, and which use methods in software development. The purpose is to describe how people work and to help companies with advice from the world of research. The research is published in internationally leading conferences and journals in the field of Software Engineering. "}],"tags":["research","way of work"]}]},{"name":"Room 17","talks":[{"talkId":42,"language":"English","difficulty":"Beginner","title":"C♭, Dragons and transpilers!","type":"Short presentation (30 minutes)","description":"In this talk we will present the design and implementation of a intermediate representation language by the name of CFLat. CFlat is designed and created for the purposes of software migration to Java and C#, as such was designed to exist in the intersection of Java and C#.","speakers":[{"name":"Hussam Yousif","info":"Hussam Yousif is a developer at Knowit Experience Bergen. He found a passion for compilers, programming languages and programming paradigms  during his years as a student which culminated in the design and creation of the intermediate representation language CFlat."}],"tags":["framework"]}]},{"name":"Room 18","talks":[{"talkId":17,"language":"English","difficulty":"Beginner","title":"Rust - An introduction to the safer system language","type":"Short presentation (30 minutes)","description":"What is Rust? In what way is it safer than say C/C++? Ànd why should you care?\nIn this introductory talk on Rust, I will cover the core principles of the lanugage as well as the importance of considering safety and stability when writing code.","speakers":[{"name":"Emil Nordén","info":"CTO / C++ & Rust enthusiast at Knowit Technology,"}],"tags":["framework"]}]},{"name":"Room 19+20","talks":[{"talkId":16,"language":"English","difficulty":"Advanced","title":"Managing customer features using feature flags","type":"Short presentation (30 minutes)","description":"Separating feature releases from code deployments can be very powerful. Enabling things such as canary releases, product owner driven releases, testing in production, granular split testing and much more.\n\nJoin me as I go over the basics and how we've implemented this at Vestas.","speakers":[{"name":"Poul Holger Hjorth Hansen","info":"Happy father of two. Senior frontend developer from the Creuna office in Aarhus, Denmark. \n\nI've worked with frontend full-time for 5-6 years with Angular on an enterprise level. \nI love all things web and have taken a liking to web-components which I advocate as much as I can.\n"}],"tags":["cloud","architecture","devops"]}]}]},{"timeStart":1015,"timeEnd":1045,"type":["Fika"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1030,"timeEnd":1100,"type":["Short presentations"],"rooms":[{"name":"Room 15","talks":[{"talkId":34,"language":"English","difficulty":"Advanced","title":"Cross plattform rust libraries","type":"Short presentation (30 minutes)","description":"In this talk I will share insights from attempting to build a shared library for iOS, Android and web for the client platforms at SVT.","speakers":[{"name":"Paul Griffin","info":"iOS developer"}],"tags":["case"]}]},{"name":"Room 16","talks":[{"talkId":13,"language":"English","difficulty":"Beginner","title":"Dark - A new approach to serverless backends","type":"Short presentation (30 minutes)","description":"Dark is a new all-in-one development environment, including a language, a web-server and an IDE.\nIt's an exciting new way to write backends, combining existing ideas in new original ways.\nAlthough in beta, it is mature enough for rapid prototyping and personal projects. \nIn this talk we'll go through what makes the Dark platform unique compared to more traditional backend stacks. We will also be doing a live demo, building a backend from scratch. ","speakers":[{"name":"Ole Eskild Steensen","info":"Full-stack developer working in Knowit Experience Bergen"}],"tags":["framework"]}]},{"name":"Room 17","talks":[{"talkId":44,"language":"English","difficulty":"Intermediate","title":"AWS Data Pipelines","type":"Short presentation (30 minutes)","description":"Modern ways to build data pipelines in AWS","speakers":[{"name":"Saku Vaittinen","info":"Saku is a Senior Cloud Architect in Knowit Cloud Partnerships focusing on Data & Analytics on AWS. He has been working with AWS services and technologies since 2010 in developer and architect roles."}],"tags":["architecture"]}]},{"name":"Room 18","talks":[{"talkId":3,"language":"English","difficulty":"Beginner","title":"Agile Agent dice and agility panel","type":"Short presentation (30 minutes)","description":"This session is inspired by the much liked session of Knowit Agile Agent podcast where we through role-playing dice and couple an agile term and an everyday term and discuss the associations that some up. Much agile learning, and much fun! I'll invite a few courageous conference participants to be the panelists with me. You’ll get some idea how it works from here: https://www.youtube.com/watch?v=K2gIutkiWgc&t=574s","speakers":[{"name":"Kari Kakkonen","info":"Mr. Kari Kakkonen has M.Sc. in from Aalto University (aalto.fi). He has also studied in University of Wisconsin-Madison (wisc.edu) in United States. He has ISTQB Expert Level Test Management Full, Agile Tester, Test Automation Engineer, Scrum Master, SAFe and DASA DevOps certificates, and works mostly with agile testing, lean, test automation, DevOps and AI. He has in testing since 1996. \nKari Kakkonen is author and CEO of Dragons Out Oy, creating a fantasy book to teach software testing to children. Kari Kakkonen is working in Finland at Knowit (knowit.fi), which is a Nordic ICT services company known for testing consultancy and software development, and other innovative ICT related services. \nKari is Treasurer of Finnish Software Testing Board FiSTB (fistb.fi), ISTQB Executive committee 2015-2021. Kari has been included in IT–magazine “Tivi” 100 most influential people listing. Kari is co-author of Agile Testing Foundations –book.\nKari is a singer, snowboarder, kayaker, husband and dad.\n"}],"tags":["agile","way of work"]}]},{"name":"Room 19+20","talks":[{"talkId":23,"language":"English","difficulty":"Intermediate","title":"[CANCELLED] Why technical debt accumulates, and how to repay it","type":"Short presentation (30 minutes)","description":"CANCELLED","speakers":[{"name":"-","info":"-"}],"tags":["tools and techniques"]}]}]},{"timeStart":1100,"timeEnd":1115,"type":["Break"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1115,"timeEnd":1200,"type":["Keynotes"],"rooms":[{"name":"Room 17+18","talks":[{"talkId":51,"language":"English","difficulty":"Beginner","title":"Where is the consultancy sector heading?","type":"Keynote (45 minutes)","description":"Some scenarios, thoughts and reflections","speakers":[{"name":"Thomas Sanden","info":"Tomas Sanden is an experienced specialist in technology management and business development for industrial organizations. He is especially interested in organizational development and operating models. Tomas has been working both in line organizations and in consultancy ones and has 30 years in leading roles.\n\nDuring the 18 years he has worked at Knowit, he has had several different roles, such as: Daughter company CEO, Head of business area Insight, Region manager Solution Gothenburg and VP M&A and Start-ups at Knowit Insight (now)."}],"tags":["way of work"]}]}]},{"timeStart":1200,"timeEnd":1210,"type":["Outro Room 17+18"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]},{"timeStart":1210,"timeEnd":1340,"type":["Lunch"],"rooms":[{"name":"ERROR! No undefined provided.","talks":[]}]}]}],"rooms":[0,1,2,3,4],"languages":["Norwegian","English","Swedish"]}}